In [4]:
# Series object in pandas
import pandas as pd
data = [1, 2, 3, 4]
series = pd.Series(data)

In [8]:
import pandas as pd
data = [1, 2, 3, 4]
series = pd.Series(data)
print(series)

0    1
1    2
2    3
3    4
dtype: int64

In [9]:
type(series)

pandas.core.series.Series

In [10]:
# Changing the index of a series object from integer based default index
series1 = pd.Series(data, index=['a','b','c','d'])
print(series1)

a    1
b    2
c    3
d    4
dtype: int64

In [11]:
# Data frame ( two dimensional data which contain row and column) here column can contain different data types.
# Features of data frame:
# ----------------------------------------------------
# mutable size
# different column types
# mutable size 
# labeled axes
# arithmetic operations on row and columns
# -------------------------------------------------------------
# How to create data frame
# creating a data frame using a list
import pandas as pd
data = [10, 20, 30, 40]
df = pd.DataFrame(data)
df

    0
0  10
1  20
2  30
3  40

In [12]:
# creating a data frame using a dictionary
dictionary = {'values':['a','b','c'], 'index':[10, 20, 15]}
df = pd.DataFrame(dictionary)
df

  values  index
0      a     10
1      b     20
2      c     15

In [13]:
# Creating a data frame using a series
series = pd.Series(data, index =['joj','do','aa','kk'])
df = pd.DataFrame(series)
df

      0
joj  10
do   20
aa   30
kk   40

In [16]:
# Creating a data frame using a numpy array
import numpy as np
numpyarray = np.array([[12000, 130000, 34000], ['Srb','jtu','Aap']])
df = pd.DataFrame({'name': numpyarray[1], 'salary': numpyarray[0]})
df

  name  salary
0  Srb   12000
1  jtu  130000
2  Aap   34000

# Perform merge operations

In [23]:
import pandas as pd
# create two dataframe first
employee = ['John','Andrew','Roy','Sam']
salary = [25000, 35000, 23400, 43000]
dept = ['dept1', 'dept2', 'dept3','dept4']
df = pd.DataFrame({'employee': employee, 'salary': salary, 'dept': dept})
df

  employee  salary   dept
0     John   25000  dept1
1   Andrew   35000  dept2
2      Roy   23400  dept3
3      Sam   43000  dept4

In [20]:
deptTbArray = np.array([['dept1', 'dept2','dept5', 'dept6', 'dept7'], ['HR','IT', 'Admin', 'Eng', 'Content']])
deptTbArray

array([['dept1', 'dept2', 'dept5', 'dept6', 'dept7'],
       ['HR', 'IT', 'Admin', 'Eng', 'Content']], dtype='<U7')

In [21]:
df2 = pd.DataFrame({'dept': deptTbArray[0], 'deptName': deptTbArray[1]})
df2

    dept deptName
0  dept1       HR
1  dept2       IT
2  dept5    Admin
3  dept6      Eng
4  dept7  Content

In [25]:
# inner merge
df2.merge(df, on='dept', how='inner')

    dept deptName employee  salary
0  dept1       HR     John   25000
1  dept2       IT   Andrew   35000

In [26]:
# outer merge
df2.merge(df, on = 'dept', how = 'outer')

    dept deptName employee   salary
0  dept1       HR     John  25000.0
1  dept2       IT   Andrew  35000.0
2  dept5    Admin      NaN      NaN
3  dept6      Eng      NaN      NaN
4  dept7  Content      NaN      NaN
5  dept3      NaN      Roy  23400.0
6  dept4      NaN      Sam  43000.0